purduerov/X13_Embedded/X13ESC/X13ESC.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F0
ProjectManager.MainLocation=Core/Src
NVIC.TIM14_IRQn=true\:0\:0\:false\:false\:true\:true\:true
ProjectManager.ProjectFileName=X13ESC.ioc
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F042K6Tx
Mcu.PinsNb=7
VP_TIM14_VS_ClockSourceINT.Signal=TIM14_VS_ClockSourceINT
ProjectManager.NoMain=false
RCC.PLLCLKFreq_Value=16000000
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_CAN_Init-CAN-false-HAL-true,4-MX_ADC_Init-ADC-false-HAL-true,5-MX_TIM14_Init-TIM14-false-HAL-true
PA11.Mode=Master
ProjectManager.DefaultFWLocation=true
ADC.IPParameters=SamplingTime
CAN.SJW=CAN_SJW_1TQ
NVIC.SVC_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.DeletePrevious=true
PinOutPanel.RotationAngle=0
RCC.FamilyName=M
ProjectManager.StackSize=0x400
Mcu.IP4=SYS
Mcu.IP5=TIM14
Mcu.IP2=NVIC
Mcu.IP3=RCC
Mcu.IP0=ADC
PA11.Locked=true
PA15.Locked=true
Mcu.IP1=CAN
PA12.Signal=CAN_TX
CAN.BS2=CAN_BS2_4TQ
CAN.BS1=CAN_BS1_11TQ
CAN.Prescaler=4
NVIC.ADC1_IRQn=true\:0\:0\:false\:false\:true\:true\:true
Mcu.UserConstants=
ProjectManager.TargetToolchain=STM32CubeIDE
Mcu.ThirdPartyNb=0
Mcu.IPNb=6
ProjectManager.PreviousToolchain=
Mcu.Pin6=VP_TIM14_VS_ClockSourceINT
ProjectManager.RegisterCallBack=ADC,CAN,TIM
Mcu.Pin0=PA0
Mcu.Pin1=PA11
Mcu.Pin2=PA12
Mcu.Pin3=PA15
Mcu.Pin4=PB3
ADC.SamplingTime=ADC_SAMPLETIME_71CYCLES_5
Mcu.Pin5=VP_SYS_VS_Systick
ProjectManager.ProjectBuild=false
PA0.Locked=true
board=custom
TIM14.Period=65535
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
ProjectManager.LastFirmware=true
RCC.VCOOutput2Freq_Value=8000000
ProjectManager.FirmwarePackage=STM32Cube FW_F0 V1.11.2
MxDb.Version=DB.6.0.0
ProjectManager.BackupPrevious=false
MxCube.Version=6.0.0
File.Version=6
VP_SYS_VS_Systick.Mode=SysTick
PA0.Mode=IN0
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
CAN.IPParameters=CalculateTimeQuantum,Prescaler,BS1,BS2,SJW
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.FreePins=false
RCC.IPParameters=CECFreq_Value,FamilyName,HSICECFreq_Value,PLLCLKFreq_Value,PLLMCOFreq_Value,TimSysFreq_Value,VCOOutput2Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F042K(4-6)Tx
CAN.CalculateTimeQuantum=500.0
ProjectManager.HalAssertFull=false
TIM14.Prescaler=8000 - 1
ProjectManager.ProjectName=X13ESC
ProjectManager.UnderRoot=true
PA0.Signal=ADC_IN0
RCC.HSICECFreq_Value=32786.88524590164
RCC.PLLMCOFreq_Value=16000000
ProjectManager.CoupleFile=false
PB3.Signal=GPIO_Output
NVIC.CEC_CAN_IRQn=true\:0\:0\:false\:false\:true\:true\:true
Mcu.Package=LQFP32
RCC.TimSysFreq_Value=8000000
PA12.Mode=Master
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
ProjectManager.CompilerOptimize=6
ProjectManager.ToolChainLocation=
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PA11.Signal=CAN_RX
PA15.Signal=GPIO_Output
ProjectManager.HeapSize=0x200
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.ComputerToolchain=false
RCC.CECFreq_Value=32786.88524590164
VP_TIM14_VS_ClockSourceINT.Mode=Enable_Timer
TIM14.IPParameters=Prescaler,Period
ProjectManager.CustomerFirmwarePackage=
ProjectManager.DeviceId=STM32F042K6Tx
ProjectManager.LibraryCopy=1
PB3.Locked=true
